<a href="https://colab.research.google.com/github/mahimscit/DO180-apps/blob/master/SQLCaseStudy2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

SQL Case Study - 2

In [1]:
import sqlite3

conn = sqlite3.connect('TCompany.db')

cursor = conn.cursor()

cursor.execute('''
CREATE TABLE LOCATION (
  Location_ID INT PRIMARY KEY,
  City VARCHAR(50)
);
''')

conn.commit()

conn.close()

In [2]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("INSERT INTO LOCATION (Location_ID, City) VALUES (122, 'New York')")
cursor.execute("INSERT INTO LOCATION (Location_ID, City) VALUES (123, 'Dallas')")
cursor.execute("INSERT INTO LOCATION (Location_ID, City) VALUES (124, 'Chicago')")
cursor.execute("INSERT INTO LOCATION (Location_ID, City) VALUES (167, 'Boston')")

conn.commit()

conn.close()

In [3]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
CREATE TABLE DEPARTMENT (
  Department_Id INT PRIMARY KEY,
  Name VARCHAR(50),
  Location_Id INT,
  FOREIGN KEY (Location_Id) REFERENCES LOCATION(Location_ID)
);
''')

conn.commit()

conn.close()

In [4]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("INSERT INTO DEPARTMENT (Department_Id, Name, Location_Id) VALUES (10, 'Accounting', 122)")
cursor.execute("INSERT INTO DEPARTMENT (Department_Id, Name, Location_Id) VALUES (20, 'Sales', 124)")
cursor.execute("INSERT INTO DEPARTMENT (Department_Id, Name, Location_Id) VALUES (30, 'Research', 123)")
cursor.execute("INSERT INTO DEPARTMENT (Department_Id, Name, Location_Id) VALUES (40, 'Operations', 167)")

conn.commit()

conn.close()

In [5]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
CREATE TABLE JOB (
  Job_ID INT PRIMARY KEY,
  Designation VARCHAR(50)
);
''')

conn.commit()

conn.close()

In [6]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (667, 'CLERK')")
cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (668, 'STAFF')")
cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (669, 'ANALYST')")
cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (670, 'SALES_PERSON')")
cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (671, 'MANAGER')")
cursor.execute("INSERT INTO JOB (Job_ID, Designation) VALUES (672, 'PRESIDENT')")

conn.commit()

conn.close()

In [7]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
CREATE TABLE EMPLOYEE (
  EMPLOYEE_ID INT,
  LAST_NAME VARCHAR(20),
  FIRST_NAME VARCHAR(20),
  MIDDLE_NAME CHAR(1),
  JOB_ID INT,
  MANAGER_ID INT,
  HIRE_DATE DATE,
  SALARY INT,
  COMM INT,
  DEPARTMENT_ID INT,
  FOREIGN KEY (JOB_ID) REFERENCES JOB(JOB_ID),
  FOREIGN KEY (DEPARTMENT_ID) REFERENCES DEPARTMENT(DEPARTMENT_ID)
);
''')

conn.commit()

conn.close()

In [8]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("INSERT INTO EMPLOYEE VALUES (7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, NULL, 20)")
cursor.execute("INSERT INTO EMPLOYEE VALUES (7499, 'ALLEN', 'KEVIN', 'J', 670, 7698, '20-FEB-84', 1600, 300, 30)")
cursor.execute("INSERT INTO EMPLOYEE VALUES (7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, NULL, 30)")
cursor.execute("INSERT INTO EMPLOYEE VALUES (7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, NULL, 30)")
cursor.execute("INSERT INTO EMPLOYEE VALUES (7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, NULL, 40)")
cursor.execute("INSERT INTO EMPLOYEE VALUES (7521, 'WARK', 'CYNTHIA', 'D', 670, 7698, '22-FEB-85', 1250, 500, 30)")

conn.commit()

conn.close()

Simple Queries:

1. List all the employee details.

In [9]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7499, 'ALLEN', 'KEVIN', 'J', 670, 7698, '20-FEB-84', 1600, 300, 30)
(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)
(7521, 'WARK', 'CYNTHIA', 'D', 670, 7698, '22-FEB-85', 1250, 500, 30)

2. List all the department details.

In [10]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM DEPARTMENT")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(10, 'Accounting', 122)
(20, 'Sales', 124)
(30, 'Research', 123)
(40, 'Operations', 167)

3. List all job details.

In [11]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM JOB")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(667, 'CLERK')
(668, 'STAFF')
(669, 'ANALYST')
(670, 'SALES_PERSON')
(671, 'MANAGER')
(672, 'PRESIDENT')

4. List all the locations.

In [12]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM LOCATION")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(122, 'New York')
(123, 'Dallas')
(124, 'Chicago')
(167, 'Boston')

5. List out the First Name, Last Name, Salary, Commission for all Employees.

In [13]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT FIRST_NAME, LAST_NAME, SALARY, COMM FROM EMPLOYEE")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH', 800, None)
('KEVIN', 'ALLEN', 1600, 300)
('JEAN', 'DOYLE', 2850, None)
('LYNN', 'DENNIS', 2750, None)
('LESLIE', 'BAKER', 2200, None)
('CYNTHIA', 'WARK', 1250, 500)

6. List out the Employee ID, Last Name, Department ID for all employees and
alias
Employee ID as "ID of the Employee", Last Name as "Name of the
Employee", Department ID as "Dep_id".

In [15]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    EMPLOYEE_ID AS "ID of the Employee",
    LAST_NAME AS "Name of the Employee",
    DEPARTMENT_ID AS "Dep_id"
FROM
    EMPLOYEE
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 20)
(7499, 'ALLEN', 30)
(7505, 'DOYLE', 30)
(7506, 'DENNIS', 30)
(7507, 'BAKER', 40)
(7521, 'WARK', 30)

7. List out the annual salary of the employees with their names only.

In [16]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT FIRST_NAME, LAST_NAME, SALARY * 12 AS Annual_Salary FROM EMPLOYEE")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH', 9600)
('KEVIN', 'ALLEN', 19200)
('JEAN', 'DOYLE', 34200)
('LYNN', 'DENNIS', 33000)
('LESLIE', 'BAKER', 26400)
('CYNTHIA', 'WARK', 15000)

WHERE Condition:

1. List the details about "Smith".

In [17]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE LAST_NAME = 'Smith'")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

2. List out the employees who are working in department 20.

In [18]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE DEPARTMENT_ID = 20")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)

3. List out the employees who are earning salary between 2000 and 3000.

In [19]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE SALARY BETWEEN 2000 AND 3000")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)

4. List out the employees who are working in department 10 or 20.
5. Find out the employees who are not working in department 10 or 30.
6. List out the employees whose name starts with 'L'.

In [21]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE DEPARTMENT_ID = 10 OR DEPARTMENT_ID = 20")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)

In [22]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE DEPARTMENT_ID NOT IN (10, 30)")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)

In [23]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE FIRST_NAME LIKE 'L%'")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)

7. List out the employees whose name starts with 'L' and ends with 'E'.

In [24]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE FIRST_NAME LIKE 'L%E'")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)

8. List out the employees whose name length is 4 and start with 'J'.

In [25]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE FIRST_NAME LIKE 'J%' AND LENGTH(FIRST_NAME) = 4")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)

9. List out the employees who are working in department 30 and draw the
salaries more than 2500.

In [26]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE DEPARTMENT_ID = 30 AND SALARY > 2500")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)

10. List out the employees who are not receiving commission.

In [27]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE WHERE COMM IS NULL")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)

ORDER BY Clause:

1. List out the Employee ID and Last Name in ascending order based on the
Employee ID.

In [28]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT EMPLOYEE_ID, LAST_NAME FROM EMPLOYEE ORDER BY EMPLOYEE_ID ASC")

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'SMITH')
(7499, 'ALLEN')
(7505, 'DOYLE')
(7506, 'DENNIS')
(7507, 'BAKER')
(7521, 'WARK')

2. List out the Employee ID and Name in descending order based on salary.

In [29]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT EMPLOYEE_ID, FIRST_NAME, LAST_NAME FROM EMPLOYEE ORDER BY SALARY DESC")
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7505, 'JEAN', 'DOYLE')
(7506, 'LYNN', 'DENNIS')
(7507, 'LESLIE', 'BAKER')
(7499, 'KEVIN', 'ALLEN')
(7521, 'CYNTHIA', 'WARK')
(7369, 'JOHN', 'SMITH')

3. List out the employee details according to their Last Name in ascending-order.

In [30]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE ORDER BY LAST_NAME ASC")
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7499, 'ALLEN', 'KEVIN', 'J', 670, 7698, '20-FEB-84', 1600, 300, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7521, 'WARK', 'CYNTHIA', 'D', 670, 7698, '22-FEB-85', 1250, 500, 30)

4. List out the employee details according to their Last Name in ascending
order and then Department ID in descending order.

In [31]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT * FROM EMPLOYEE ORDER BY LAST_NAME ASC, DEPARTMENT_ID DESC")
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7499, 'ALLEN', 'KEVIN', 'J', 670, 7698, '20-FEB-84', 1600, 300, 30)
(7507, 'BAKER', 'LESLIE', 'D', 671, 7839, '10-JUN-85', 2200, None, 40)
(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)
(7505, 'DOYLE', 'JEAN', 'K', 671, 7839, '04-APR-85', 2850, None, 30)
(7369, 'SMITH', 'JOHN', 'Q', 667, 7902, '17-DEC-84', 800, None, 20)
(7521, 'WARK', 'CYNTHIA', 'D', 670, 7698, '22-FEB-85', 1250, 500, 30)

GROUP BY and HAVING Clause:

1. List out the department wise maximum salary, minimum salary and
average salary of the employees.

In [32]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    DEPARTMENT_ID,
    MAX(SALARY) AS MaxSalary,
    MIN(SALARY) AS MinSalary,
    AVG(SALARY) AS AvgSalary
FROM
    EMPLOYEE
GROUP BY
    DEPARTMENT_ID
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(20, 800, 800, 800.0)
(30, 2850, 1250, 2112.5)
(40, 2200, 2200, 2200.0)

2. List out the job wise maximum salary, minimum salary and average
salary of the employees.

In [33]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    JOB_ID,
    MAX(SALARY) AS MaxSalary,
    MIN(SALARY) AS MinSalary,
    AVG(SALARY) AS AvgSalary
FROM
    EMPLOYEE
GROUP BY
    JOB_ID
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(667, 800, 800, 800.0)
(670, 1600, 1250, 1425.0)
(671, 2850, 2200, 2600.0)

3. List out the number of employees who joined each month in ascending order

In [34]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    STRFTIME('%m', HIRE_DATE) AS HireMonth,
    COUNT(*) AS EmployeeCount
FROM
    EMPLOYEE
GROUP BY
    HireMonth
ORDER BY
    HireMonth ASC
''')
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(None, 6)

4. List out the number of employees for each month and year in
ascending order based on the year and month.

In [35]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    STRFTIME('%Y', HIRE_DATE) AS HireYear,
    STRFTIME('%m', HIRE_DATE) AS HireMonth,
    COUNT(*) AS EmployeeCount
FROM
    EMPLOYEE
GROUP BY
    HireYear, HireMonth
ORDER BY
    HireYear ASC, HireMonth ASC
''')
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(None, None, 6)

5. List out the Department ID having at least four employees.

In [36]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    DEPARTMENT_ID
FROM
    EMPLOYEE
GROUP BY
    DEPARTMENT_ID
HAVING
    COUNT(*) >= 4
''')
results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(30,)

6. How many employees joined in February month.

In [37]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT COUNT(*) FROM EMPLOYEE WHERE STRFTIME('%m', HIRE_DATE) = '02'")

result = cursor.fetchone()

print(result[0])

conn.close()

0

7. How many employees joined in May or June month.

In [38]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT COUNT(*) FROM EMPLOYEE WHERE STRFTIME('%m', HIRE_DATE) = '05' OR STRFTIME('%m', HIRE_DATE) = '06'")

result = cursor.fetchone()

print(result[0])

conn.close()

0

8. How many employees joined in 1985?

In [39]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT COUNT(*) FROM EMPLOYEE WHERE STRFTIME('%Y', HIRE_DATE) = '1985'")

result = cursor.fetchone()

print(result[0])

conn.close()

0

9. How many employees joined each month in 1985?

In [40]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    STRFTIME('%m', HIRE_DATE) AS HireMonth,
    COUNT(*) AS EmployeeCount
FROM
    EMPLOYEE
WHERE
    STRFTIME('%Y', HIRE_DATE) = '1985'
GROUP BY
    HireMonth
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

10. How many employees were joined in April 1985?

In [41]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute("SELECT COUNT(*) FROM EMPLOYEE WHERE STRFTIME('%Y', HIRE_DATE) = '1985' AND STRFTIME('%m', HIRE_DATE) = '04'")

result = cursor.fetchone()

print(result[0])

conn.close()

0

11. Which is the Department ID having greater than or equal to 3 employees
joining in April 1985?

In [42]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    DEPARTMENT_ID
FROM
    EMPLOYEE
WHERE
    STRFTIME('%Y', HIRE_DATE) = '1985' AND STRFTIME('%m', HIRE_DATE) = '04'
GROUP BY
    DEPARTMENT_ID
HAVING
    COUNT(*) >= 3
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

Joins:

1. List out employees with their department names.

In [44]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    E.FIRST_NAME,
    E.LAST_NAME,
    D.NAME
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH', 'Sales')
('KEVIN', 'ALLEN', 'Research')
('JEAN', 'DOYLE', 'Research')
('LYNN', 'DENNIS', 'Research')
('LESLIE', 'BAKER', 'Operations')
('CYNTHIA', 'WARK', 'Research')

2. Display employees with their designations.

In [46]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    E.FIRST_NAME,
    E.LAST_NAME,
    J.Designation
FROM
    EMPLOYEE E
JOIN
    JOB J ON E.JOB_ID = J.JOB_ID
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH', 'CLERK')
('KEVIN', 'ALLEN', 'SALES_PERSON')
('JEAN', 'DOYLE', 'MANAGER')
('LYNN', 'DENNIS', 'MANAGER')
('LESLIE', 'BAKER', 'MANAGER')
('CYNTHIA', 'WARK', 'SALES_PERSON')

3. Display the employees with their department names and city.

In [48]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    E.FIRST_NAME,
    E.LAST_NAME,
    D.NAME,
    L.CITY
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
JOIN
    LOCATION L ON D.LOCATION_ID = L.Location_ID
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH', 'Sales', 'Chicago')
('KEVIN', 'ALLEN', 'Research', 'Dallas')
('JEAN', 'DOYLE', 'Research', 'Dallas')
('LYNN', 'DENNIS', 'Research', 'Dallas')
('LESLIE', 'BAKER', 'Operations', 'Boston')
('CYNTHIA', 'WARK', 'Research', 'Dallas')

4. How many employees are working in different departments? Display with
department names.

In [50]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    D.NAME,
    COUNT(E.EMPLOYEE_ID) AS NumberOfEmployees
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
GROUP BY
    D.NAME
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('Operations', 1)
('Research', 4)
('Sales', 1)

5. How many employees are working in the sales department?

In [55]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    COUNT(*)
FROM
    EMPLOYEE
WHERE
    DEPARTMENT_ID = (SELECT Department_Id FROM DEPARTMENT WHERE Name = 'Sales')
''')

result = cursor.fetchone()

print(result[0])

conn.close()

1

6. Which is the department having greater than or equal to 3
employees and display the department names in
ascending order.

In [57]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    D.NAME
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.DEPARTMENT_ID
GROUP BY
    D.NAME
HAVING
    COUNT(*) >= 3
ORDER BY
    D.NAME ASC
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('Research',)

7. How many employees are working in 'Dallas'?

In [58]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    COUNT(*)
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.DEPARTMENT_ID
JOIN
    LOCATION L ON D.LOCATION_ID = L.LOCATION_ID
WHERE
    L.CITY = 'Dallas'
''')

result = cursor.fetchone()

print(result[0])

conn.close()

4

8. Display all employees in sales or operation departments.

In [60]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    E.FIRST_NAME,
    E.LAST_NAME
FROM
    EMPLOYEE E
JOIN
    DEPARTMENT D ON E.DEPARTMENT_ID = D.DEPARTMENT_ID
WHERE
    D.NAME IN ('Sales', 'Operations')
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('JOHN', 'SMITH')
('LESLIE', 'BAKER')

CONDITIONAL STATEMENT

1. Display the employee details with salary grades. Use conditional statement to create a grade column.

In [61]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    EMPLOYEE_ID,
    FIRST_NAME,
    LAST_NAME,
    SALARY,
    CASE
        WHEN SALARY >= 50000 THEN 'A'
        WHEN SALARY >= 30000 AND SALARY < 50000 THEN 'B'
        WHEN SALARY >= 10000 AND SALARY < 30000 THEN 'C'
        ELSE 'D'
    END AS SalaryGrade
FROM
    EMPLOYEE
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'JOHN', 'SMITH', 800, 'D')
(7499, 'KEVIN', 'ALLEN', 1600, 'D')
(7505, 'JEAN', 'DOYLE', 2850, 'D')
(7506, 'LYNN', 'DENNIS', 2750, 'D')
(7507, 'LESLIE', 'BAKER', 2200, 'D')
(7521, 'CYNTHIA', 'WARK', 1250, 'D')

2. List out the number of employees grade wise. Use conditional statement to
create a grade column.

In [62]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    CASE
        WHEN SALARY >= 50000 THEN 'A'
        WHEN SALARY >= 30000 AND SALARY < 50000 THEN 'B'
        WHEN SALARY >= 10000 AND SALARY < 30000 THEN 'C'
        ELSE 'D'
    END AS SalaryGrade,
    COUNT(*) AS NumberOfEmployees
FROM
    EMPLOYEE
GROUP BY
    SalaryGrade
ORDER BY
    SalaryGrade ASC
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('D', 6)

3. Display the employee salary grades and the number of employees between
2000 to 5000 range of salary.

In [63]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    CASE
        WHEN SALARY >= 50000 THEN 'A'
        WHEN SALARY >= 30000 AND SALARY < 50000 THEN 'B'
        WHEN SALARY >= 10000 AND SALARY < 30000 THEN 'C'
        ELSE 'D'
    END AS SalaryGrade,
    COUNT(*) AS NumberOfEmployees
FROM
    EMPLOYEE
WHERE
    SALARY BETWEEN 2000 AND 5000
GROUP BY
    SalaryGrade
ORDER BY
    SalaryGrade ASC
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('D', 3)

Subqueries:

1. Display the employees list who got the maximum salary.

In [64]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT
    EMPLOYEE_ID,
    FIRST_NAME,
    LAST_NAME,
    SALARY
FROM
    EMPLOYEE
WHERE
    SALARY = (SELECT MAX(SALARY) FROM EMPLOYEE)
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7505, 'JEAN', 'DOYLE', 2850)

2. Display the employees who are working in the sales department.

In [65]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT E.EMPLOYEE_ID, E.FIRST_NAME, E.LAST_NAME
FROM EMPLOYEE E
JOIN DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
WHERE D.Name = 'Sales';
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'JOHN', 'SMITH')

3. Display the employees who are working as 'Clerk'.

In [66]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT E.EMPLOYEE_ID, E.FIRST_NAME, E.LAST_NAME
FROM EMPLOYEE E
JOIN JOB J ON E.JOB_ID = J.JOB_ID
WHERE J.Designation = 'CLERK';
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7369, 'JOHN', 'SMITH')

4. Display the list of employees who are living in 'Boston'.

In [67]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT E.EMPLOYEE_ID, E.FIRST_NAME, E.LAST_NAME
FROM EMPLOYEE E
JOIN DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
JOIN LOCATION L ON D.Location_Id = L.Location_ID
WHERE L.City = 'Boston';
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7507, 'LESLIE', 'BAKER')

5. Find out the number of employees working in the sales department.

In [68]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT COUNT(*)
FROM EMPLOYEE
WHERE DEPARTMENT_ID = (SELECT Department_Id FROM DEPARTMENT WHERE Name = 'Sales');
''')

result = cursor.fetchone()

print(result[0])

conn.close()

1

6. Update the salaries of employees who are working as clerks on the basis of
10%.

In [69]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
UPDATE EMPLOYEE
SET SALARY = SALARY * 1.10
WHERE JOB_ID = (SELECT Job_ID FROM JOB WHERE Designation = 'CLERK');
''')

conn.commit()
conn.close()

7. Display the second highest salary drawing employee details.

In [70]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT *
FROM EMPLOYEE
WHERE SALARY = (SELECT MAX(SALARY) FROM EMPLOYEE
                 WHERE SALARY < (SELECT MAX(SALARY) FROM EMPLOYEE));
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7506, 'DENNIS', 'LYNN', 'S', 671, 7839, '15-MAY-85', 2750, None, 30)

8. List out the employees who earn more than every employee in department 30.

In [71]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT *
FROM EMPLOYEE
WHERE SALARY > (SELECT MAX(SALARY) FROM EMPLOYEE WHERE DEPARTMENT_ID = 30);
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

9. Find out which department has no employees.

In [72]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT D.Name
FROM DEPARTMENT D
LEFT JOIN EMPLOYEE E ON D.Department_Id = E.DEPARTMENT_ID
WHERE E.EMPLOYEE_ID IS NULL;
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

('Accounting',)

10. Find out the employees who earn greater than the average salary for
their department.

In [73]:
import sqlite3

conn = sqlite3.connect('TCompany.db')
cursor = conn.cursor()

cursor.execute('''
SELECT E.EMPLOYEE_ID, E.FIRST_NAME, E.LAST_NAME, E.SALARY, D.Name
FROM EMPLOYEE E
JOIN DEPARTMENT D ON E.DEPARTMENT_ID = D.Department_Id
WHERE E.SALARY > (SELECT AVG(SALARY) FROM EMPLOYEE WHERE DEPARTMENT_ID = E.DEPARTMENT_ID);
''')

results = cursor.fetchall()

for row in results:
    print(row)

conn.close()

(7505, 'JEAN', 'DOYLE', 2850, 'Research')
(7506, 'LYNN', 'DENNIS', 2750, 'Research')